solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/power_manager/core/fsl_pm_core.c
/*
 * Copyright 2021-2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <stdarg.h>

#include "fsl_pm_core.h"
#include "fsl_pm_device.h"

/*
 * $Coverage Justification Reference$
 *
 * $Justification pm_core_c_ref_1$
 * This depends on device implementation. The "clean" function is not NULL with tested devices.
 *
 * $Justification pm_core_c_ref_2$
 * Error doesn't happen in test case.
 */

/*******************************************************************************
 * Variables
 ******************************************************************************/
extern pm_device_option_t g_devicePMOption;
AT_ALWAYS_ON_DATA(static pm_handle_t *s_pmHandle);

static uint32_t s_defaultPMIrqMask = 0UL;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static uint8_t PM_findDeepestState(uint64_t duration);

#if (defined(FSL_PM_SUPPORT_NOTIFICATION) && FSL_PM_SUPPORT_NOTIFICATION)
static status_t PM_notifyPowerStateEntry(uint8_t powerState);
static status_t PM_notifyPowerStateExit(uint8_t powerState);
#endif /* FSL_PM_SUPPORT_NOTIFICATION */

static void PM_SetAllowedLowestPowerMode(void);

/*******************************************************************************
 * Code
 ******************************************************************************/

/***************************************************************
 * Private Funtions
 ***************************************************************/
static uint8_t PM_findDeepestState(uint64_t duration)
{
    uint8_t i              = 0U;
    uint8_t ret            = 0xFFU;
    uint8_t j              = 0U;
    pm_state_t *state      = NULL;
    bool stateSatisfy      = false;
    pm_state_t *stateArray = s_pmHandle->deviceOption->states;
    uint8_t stateCount     = (s_pmHandle->deviceOption->stateCount);
    pm_resc_mask_t tmpSoftRescMask;

    for (i = stateCount; i >= 1U; i--)
    {
        state = &stateArray[(i - 1U)];

        stateSatisfy = false;
        /*
         * The next power state's exit latency should be smaller than low power duration.
         * And the next power state should satisfy the whole system's constraints.
         */
        if (duration == 0U)
        {
            stateSatisfy = true;
        }
        else
        {
            if (state->exitLatency < duration)
            {
                /* If the total latency is less than the duration, then this state
                 * satisfies the duration constraints */
                stateSatisfy = true;
            }
        }

        /* If the state satisfies the duration constraints, check the other system
         * constraints */
        if (stateSatisfy == true)
        {
            for (j = 0U; j < PM_RESC_MASK_ARRAY_SIZE; j++)
            {
                if ((s_pmHandle->resConstraintMask.rescMask[j] & state->fixConstraintsMask.rescMask[j]) == 0UL)
                {
                    tmpSoftRescMask.rescMask[j] =
                        state->varConstraintsMask.rescMask[j] & (s_pmHandle->resConstraintMask.rescMask[j]);
                }
                else
                {
                    stateSatisfy = false;
                    break;
                }
            }
        }

        if (stateSatisfy && ((i - 1U) <= s_pmHandle->powerModeConstraint))
        {
            (void)memcpy(&s_pmHandle->softConstraints, &tmpSoftRescMask, sizeof(pm_resc_mask_t));
            ret = (i - 1U);
            break;
        }
    }

    return ret;
}

#if (defined(FSL_PM_SUPPORT_NOTIFICATION) && FSL_PM_SUPPORT_NOTIFICATION)
static status_t PM_notifyPowerStateEntry(uint8_t powerState)
{
    uint8_t i;
    pm_notify_callback_func_t callback;
    pm_notify_element_t *currElement = NULL;
    status_t status                  = kStatus_PMSuccess;

    /* Execute from group0 to group2. */
    for (i = (uint8_t)kPM_NotifyGroup0; i <= (uint8_t)kPM_NotifyGroup2; i++)
    {
        s_pmHandle->curNotifyGroup = (pm_notify_group_t)i;
        if (LIST_GetSize((list_handle_t) & (s_pmHandle->notifyList[i])) != 0UL)
        {
            currElement = (pm_notify_element_t *)(void *)(s_pmHandle->notifyList[i].head);

            do
            {
                callback = currElement->notifyCallback;
                status   = callback(kPM_EventEnteringSleep, powerState, currElement->data);
                if (status != kStatus_Success)
                {
                    s_pmHandle->curNotifyElement = currElement;
                    return kStatus_PMNotifyEventError;
                }
                currElement = (pm_notify_element_t *)(void *)currElement->link.next;
            } while (currElement != NULL);
        }
    }

    s_pmHandle->curNotifyGroup   = kPM_NotifyGroup2;
    s_pmHandle->curNotifyElement = NULL;
    return kStatus_PMSuccess;
}

static status_t PM_notifyPowerStateExit(uint8_t powerState)
{
    int8_t i;
    pm_notify_element_t *currElement = NULL;

    if (s_pmHandle->curNotifyElement != NULL)
    {
        i = (int8_t)(s_pmHandle->curNotifyGroup);
    }
    else
    {
        /* execute Group 2 first on exit from low power */
        i = (int8_t)kPM_NotifyGroup2;
    }

    /* Execute from group2 to group0. */
    for (; i >= (int8_t)kPM_NotifyGroup0; i--)
    {
        if (LIST_GetSize((list_handle_t) & (s_pmHandle->notifyList[i])) != 0UL)
        {
            currElement = (pm_notify_element_t *)(void *)(s_pmHandle->notifyList[i].head);

            do
            {
                (void)(currElement->notifyCallback(kPM_EventExitingSleep, powerState, currElement->data));
                if (currElement == s_pmHandle->curNotifyElement)
                {
                    break;
                }
                currElement = (pm_notify_element_t *)(void *)(currElement->link.next);
            } while (currElement != NULL);
        }
    }

    return kStatus_PMSuccess;
}
#endif /* FSL_PM_SUPPORT_NOTIFICATION */

static void PM_SetAllowedLowestPowerMode(void)
{
    uint8_t lowestPowerMode = PM_LP_STATE_COUNT - 1U;
    uint8_t index;

    for (index = 0U; index < PM_LP_STATE_COUNT; index++)
    {
        if (s_pmHandle->powerModeConstraintCount[index] > 0U)
        {
            lowestPowerMode = index;
            break;
        }
    }

