solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/power_manager/core/fsl_pm_core.c
        for (i = 0; i < rescNum; i++)
        {
            inputResc = (int32_t)va_arg(ap, int32_t);
            PM_DECODE_RESC(inputResc);

            assert(rescShift < (uint32_t)PM_CONSTRAINT_COUNT);

            if (opMode != PM_RESOURCE_OFF)
            {
                switch (opMode)
                {
                    case PM_RESOURCE_FULL_ON:
                    {
                        assert(s_pmHandle->resConstraintCount[rescShift].subConter.fullOnCounter <
                               ((1U << PM_FULL_ON_COUNTER_SIZE) - 1U));
                        s_pmHandle->resConstraintCount[rescShift].subConter.fullOnCounter++;
                        break;
                    }
                    case PM_RESOURCE_PARTABLE_ON2:
                    {
                        assert(s_pmHandle->resConstraintCount[rescShift].subConter.partOn2Counter <
                               ((1U << PM_PARTABLE_ON2_COUNTER_SIZE) - 1U));
                        s_pmHandle->resConstraintCount[rescShift].subConter.partOn2Counter++;
                        break;
                    }
                    case PM_RESOURCE_PARTABLE_ON1:
                    {
                        assert(s_pmHandle->resConstraintCount[rescShift].subConter.partOn1Counter <
                               ((1U << PM_PARTABLE_ON1_COUNTER_SIZE) - 1U));
                        s_pmHandle->resConstraintCount[rescShift].subConter.partOn1Counter++;
                        break;
                    }
                    default:
                    {
                        assert(false);
                        break;
                    }
                }
                /* Set corresponding bit of operate mode in system resource group. */
                s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL] |=
                    ((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
                /* Enable corresponding bit of constraint in system resource mask. */
                s_pmHandle->resConstraintMask.rescMask[rescShift / 32UL] |= (1UL << ((uint32_t)rescShift % 32UL));
            }
        }
        va_end(ap);
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return ret;
}

/*!
 * brief Used to release constraints(including power mode constraint and resource constraints)
 *
 * For example, if the device support 3 resource constraints: PM_RESC_1, PM_RESC_2, PM_RESC3
 *  code
 *      PM_ReleaseConstraints(Sleep_Mode, 1, PM_RESC_1);
 *  endcode
 *
 * param powerModeConstraint The lowest power mode allowed, the power mode constraint macros
 *                            can be found in fsl_pm_device.h
 * param rescNum The number of resource constraints to be released.
 * return status_t The status of set constraints behavior.
 */
status_t PM_ReleaseConstraints(uint8_t powerModeConstraint, int32_t rescNum, ...)
{
    status_t ret = kStatus_Success;
    uint32_t opMode;
    uint32_t rescShift;
    int32_t inputResc;
    va_list ap;
    int32_t i;
    uint32_t curRescOpMode;
    uint32_t opModeToRelease;

    if (s_pmHandle->enterCritical != NULL)
    {
        s_pmHandle->enterCritical();
    }

    if (powerModeConstraint != PM_LP_STATE_NO_CONSTRAINT)
    {
        if (powerModeConstraint >= PM_LP_STATE_COUNT)
        {
            /* wrong power mode index passed in parameter */
            ret = kStatus_Fail;
        }
        else
        {
            /* Release power mode constraint */
            if (s_pmHandle->powerModeConstraintCount[powerModeConstraint] > 0U)
            {
                s_pmHandle->powerModeConstraintCount[powerModeConstraint]--;
            }
            PM_SetAllowedLowestPowerMode();
        }
    }
    else
    {
        /* No power mode constraint to release, only ressource constraints */
        ;
    }

    if (rescNum != 0)
    {
        va_start(ap, rescNum);

        for (i = 0; i < rescNum; i++)
        {
            inputResc = (int32_t)va_arg(ap, int32_t);
            PM_DECODE_RESC(inputResc);

            curRescOpMode   = s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL];
            opModeToRelease = ((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
            if ((curRescOpMode & opModeToRelease) != 0UL)
            {
                uint8_t subCounterValue = 0U;
                switch (opMode)
                {
                    case PM_RESOURCE_FULL_ON:
                    {
                        assert(s_pmHandle->resConstraintCount[rescShift].subConter.fullOnCounter >= 1U);
                        s_pmHandle->resConstraintCount[rescShift].subConter.fullOnCounter--;
                        subCounterValue = (s_pmHandle->resConstraintCount[rescShift].u8Count & PM_FULL_ON_COUNTER_MASK);
                        break;
                    }
                    case PM_RESOURCE_PARTABLE_ON2:
                    {
                        assert(s_pmHandle->resConstraintCount[rescShift].subConter.partOn2Counter >= 1U);
                        s_pmHandle->resConstraintCount[rescShift].subConter.partOn2Counter--;
                        subCounterValue =
                            (s_pmHandle->resConstraintCount[rescShift].u8Count & PM_PARTABLE_ON2_COUNTER_MASK);
                        break;
                    }
                    case PM_RESOURCE_PARTABLE_ON1:
                    {
                        assert(s_pmHandle->resConstraintCount[rescShift].subConter.partOn1Counter >= 1U);
                        s_pmHandle->resConstraintCount[rescShift].subConter.partOn1Counter--;
                        subCounterValue =
                            (s_pmHandle->resConstraintCount[rescShift].u8Count & PM_PARTABLE_ON1_COUNTER_MASK);
                        break;
                    }
                    default:
                    {
                        assert(false);
                        break;
                    }
                }

                if (subCounterValue == 0U)
                {
                    /* Clear corresponding bit of operate mode in system resource group. */
                    s_pmHandle->sysRescGroup.groupSlice[rescShift / 8UL] &=
                        ~((uint32_t)opMode << (4UL * ((uint32_t)rescShift % 8UL)));
                    if (s_pmHandle->resConstraintCount[rescShift].u8Count == 0U)
                    {
                        /* Disable corresponding bit of constraint in system resource mask. */
                        s_pmHandle->resConstraintMask.rescMask[rescShift / 32UL] &=
                            ~(1UL << ((uint32_t)rescShift % 32UL));
                    }
                }
            }
        }
        va_end(ap);
    }

    if (s_pmHandle->exitCritical != NULL)
    {
        s_pmHandle->exitCritical();
    }

    return ret;
}

/*!
 * brief Get current system resource constraints.
 *
 * return Current system constraints.
 */
pm_resc_mask_t PM_GetResourceConstraintsMask(void)
{
    return s_pmHandle->resConstraintMask;
}

/*!
 * brief Get current system allowed power mode.
 *
 * return Allowed lowest power mode.
 */
uint8_t PM_GetAllowedLowestPowerMode(void)
{
    return s_pmHandle->powerModeConstraint;
}
